In [7]:
import pandas as pd
import numpy as np

In [9]:
df = pd.read_csv('Bengaluru_House_Data.csv')

In [10]:
df.shape

(13320, 9)

In [12]:
df.drop( columns=[ 'society' , 'balcony'] , inplace=True)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   total_sqft    13320 non-null  object
 5   bath          13247 non-null  float64
 6   price         13320 non-null  float64
dtypes: float64(2), object(5)
memory usage: 728.6+ KB

In [14]:
df['location'] = df['location'].fillna('Sarjapur  Road')

In [15]:
df['size'].value_counts()

2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: size, dtype: int64

In [16]:
df['size'] = df['size'].fillna('2 BHK')

In [17]:
df['bath'] = df['bath'].fillna(df['bath'].median())

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13320 non-null  object
 3   size          13320 non-null  object
 4   total_sqft    13320 non-null  object
 5   bath          13320 non-null  float64
 6   price         13320 non-null  float64
dtypes: float64(2), object(5)
memory usage: 728.6+ KB

In [19]:
df['bhk'] = df['size'].str.split().str.get(0).astype(int)

In [22]:
df[df.bhk>20]

,area_type,availability,location,size,total_sqft,bath,price,bhk
1718,Super built-up Area,Ready To Move,2Electronic City Phase II,27 BHK,8000,27.0,230.0,27
4684,Plot Area,Ready To Move,Munnekollal,43 Bedroom,2400,40.0,660.0,43

In [23]:
df.drop( columns=['size'] , inplace=True)

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13320 non-null  object
 3   total_sqft    13320 non-null  object
 4   bath          13320 non-null  float64
 5   price         13320 non-null  float64
 6   bhk           13320 non-null  int64
dtypes: float64(2), int64(1), object(4)
memory usage: 728.6+ KB

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13320 non-null  object
 3   total_sqft    13320 non-null  object
 4   bath          13320 non-null  float64
 5   price         13320 non-null  float64
 6   bhk           13320 non-null  int64
dtypes: float64(2), int64(1), object(4)
memory usage: 728.6+ KB

In [26]:
df.describe()

               bath         price           bhk
count  13320.000000  13320.000000  13320.000000
mean       2.688814    112.565627      2.802778
std        1.338754    148.971674      1.294496
min        1.000000      8.000000      1.000000
25%        2.000000     50.000000      2.000000
50%        2.000000     72.000000      3.000000
75%        3.000000    120.000000      3.000000
max       40.000000   3600.000000     43.000000

In [27]:
def convertRange(x):
    temp = x.split('-')
    if len(temp) == 2:
        return (float(temp[0]) + float(temp[1]))/2
    try:
        return float(x)
    except:
        return None

In [28]:
df['total_sqft'] = df['total_sqft'].apply(convertRange)

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13320 non-null  object
 3   total_sqft    13274 non-null  float64
 4   bath          13320 non-null  float64
 5   price         13320 non-null  float64
 6   bhk           13320 non-null  int64
dtypes: float64(3), int64(1), object(3)
memory usage: 728.6+ KB

In [30]:
df.describe()

         total_sqft          bath         price           bhk
count  13274.000000  13320.000000  13320.000000  13320.000000
mean    1559.626694      2.688814    112.565627      2.802778
std     1238.405258      1.338754    148.971674      1.294496
min        1.000000      1.000000      8.000000      1.000000
25%     1100.000000      2.000000     50.000000      2.000000
50%     1276.000000      2.000000     72.000000      3.000000
75%     1680.000000      3.000000    120.000000      3.000000
max    52272.000000     40.000000   3600.000000     43.000000

In [31]:
df['price_per_sqft'] = df['price']*100000/df['total_sqft']

In [32]:
df['price_per_sqft']

0         3699.810606
1         4615.384615
2         4305.555556
3         6245.890861
4         4250.000000
             ...
13315     6689.834926
13316    11111.111111
13317     5258.545136
13318    10407.336319
13319     3090.909091
Name: price_per_sqft, Length: 13320, dtype: float64

In [33]:
df.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626694      2.688814    112.565627      2.802778    7.907501e+03
std     1238.405258      1.338754    148.971674      1.294496    1.064296e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000      2.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.311746e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [34]:
df['location'] = df['location'].apply(lambda x: x.strip())
location_count = df['location'].value_counts()

In [35]:
location_count_less_10 = location_count[location_count<=10]
location_count_less_10

Dairy Circle                      10
Nagappa Reddy Layout              10
Basapura                          10
1st Block Koramangala             10
Sector 1 HSR Layout               10
                                  ..
Bapuji Layout                      1
1st Stage Radha Krishna Layout     1
BEML Layout 5th stage              1
singapura paradise                 1
Abshot Layout                      1
Name: location, Length: 1053, dtype: int64

In [36]:
df['location'] = df['location'].apply(lambda x: 'other' if x in location_count_less_10 else x)

In [37]:
df.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626694      2.688814    112.565627      2.802778    7.907501e+03
std     1238.405258      1.338754    148.971674      1.294496    1.064296e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000      2.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.311746e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   area_type       13320 non-null  object
 1   availability    13320 non-null  object
 2   location        13320 non-null  object
 3   total_sqft      13274 non-null  float64
 4   bath            13320 non-null  float64
 5   price           13320 non-null  float64
 6   bhk             13320 non-null  int64
 7   price_per_sqft  13274 non-null  float64
dtypes: float64(4), int64(1), object(3)
memory usage: 832.6+ KB

In [39]:
df['location'].value_counts()

other                 2885
Whitefield             541
Sarjapur  Road         400
Electronic City        304
Kanakpura Road         273
                      ...
Nehru Nagar             11
Banjara Layout          11
LB Shastri Nagar        11
Pattandur Agrahara      11
Narayanapura            11
Name: location, Length: 242, dtype: int64

In [40]:
df = df[((df['total_sqft']/df['bhk']) >= 300)]
df.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  12530.000000  12530.000000  12530.000000  12530.000000    12530.000000
mean    1594.564544      2.559537    111.382401      2.650838     6303.979357
std     1261.271296      1.077938    152.077329      0.976678     4162.237981
min      300.000000      1.000000      8.440000      1.000000      267.829813
25%     1116.000000      2.000000     49.000000      2.000000     4210.526316
50%     1300.000000      2.000000     70.000000      3.000000     5294.117647
75%     1700.000000      3.000000    115.000000      3.000000     6916.666667
max    52272.000000     16.000000   3600.000000     16.000000   176470.588235

In [41]:
df.shape

(12530, 8)

In [42]:
def remove_outlier(df):
    df_output = pd.DataFrame()
    for key,subdf in df.groupby('location'):
        m = np.mean(subdf.price_per_sqft)
        st = np.std(subdf.price_per_sqft)
        
        gen_df = subdf[(subdf.price_per_sqft > (m-st)) & (subdf.price_per_sqft <= (m+st))]
        df_output = pd.concat([df_output,gen_df],ignore_index=True)
    return df_output
df = remove_outlier(df)

In [43]:
df.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  10301.000000  10301.000000  10301.000000  10301.000000    10301.000000
mean    1508.440608      2.471702     91.286372      2.574896     5659.062876
std      880.694214      0.979449     86.342786      0.897649     2265.774749
min      300.000000      1.000000     10.000000      1.000000     1250.000000
25%     1110.000000      2.000000     49.000000      2.000000     4244.897959
50%     1286.000000      2.000000     67.000000      2.000000     5175.600739
75%     1650.000000      3.000000    100.000000      3.000000     6428.571429
max    30400.000000     16.000000   2200.000000     16.000000    24509.803922

In [44]:
def bhk_outlier(df):
    exclude_indices = np.array([])
    for location,location_df in df.groupby('location'):
        bhk_stats = {}
        for bhk,bhk_df in location_df.groupby('bhk'):
            bhk_stats[bhk] = {
                'mean': np.mean(bhk_df.price_per_sqft),
                'std': np.std(bhk_df.price_per_sqft),
                'count': bhk_df.shape[0]
            }
        for bhk,bhk_df in location_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices = np.append(exclude_indices, bhk_df[bhk_df.price_per_sqft < (stats['mean'])].index.values)
    return df.drop(exclude_indices,axis='index')

In [45]:
df = bhk_outlier(df)

In [46]:
df.shape

(7360, 8)

In [47]:
df

,area_type,availability,location,total_sqft,bath,price,bhk,price_per_sqft
0,Super built-up Area,20-May,1st Block Jayanagar,2850.0,4.0,428.0,4,15017.543860
1,Super built-up Area,18-Jun,1st Block Jayanagar,1630.0,3.0,194.0,3,11901.840491
2,Super built-up Area,Ready To Move,1st Block Jayanagar,1875.0,2.0,235.0,3,12533.333333
3,Built-up Area,15-Dec,1st Block Jayanagar,1200.0,2.0,130.0,3,10833.333333
4,Super built-up Area,18-Jun,1st Block Jayanagar,1235.0,2.0,148.0,2,11983.805668
...,...,...,...,...,...,...,...,...
10292,Carpet Area,19-Jan,other,1200.0,2.0,70.0,2,5833.333333
10293,Super built-up Area,Ready To Move,other,1800.0,1.0,200.0,1,11111.111111
10296,Super built-up Area,Ready To Move,other,1353.0,2.0,110.0,2,8130.081301
10297,Plot Area,18-Jan,other,812.0,1.0,26.0,1,3201.970443
10300,Super built-up Area,Ready To Move,other,3600.0,5.0,400.0,4,11111.111111

In [48]:
df.drop(columns=['price_per_sqft'],inplace=True)

In [49]:
df.head()

,area_type,availability,location,total_sqft,bath,price,bhk
0,Super built-up Area,20-May,1st Block Jayanagar,2850.0,4.0,428.0,4
1,Super built-up Area,18-Jun,1st Block Jayanagar,1630.0,3.0,194.0,3
2,Super built-up Area,Ready To Move,1st Block Jayanagar,1875.0,2.0,235.0,3
3,Built-up Area,15-Dec,1st Block Jayanagar,1200.0,2.0,130.0,3
4,Super built-up Area,18-Jun,1st Block Jayanagar,1235.0,2.0,148.0,2

In [50]:
df.to_csv("Clean.csv")

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7360 entries, 0 to 10300
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     7360 non-null   object
 1   availability  7360 non-null   object
 2   location      7360 non-null   object
 3   total_sqft    7360 non-null   float64
 4   bath          7360 non-null   float64
 5   price         7360 non-null   float64
 6   bhk           7360 non-null   int64
dtypes: float64(3), int64(1), object(3)
memory usage: 460.0+ KB

In [107]:

df.drop(columns=['availability'],inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7360 entries, 0 to 10300
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    7360 non-null   object
 1   total_sqft  7360 non-null   float64
 2   bath        7360 non-null   float64
 3   price       7360 non-null   float64
 4   bhk         7360 non-null   int64
dtypes: float64(3), int64(1), object(1)
memory usage: 345.0+ KB

In [108]:
X = df.drop(columns=['price'])
y=df['price']

In [116]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=0)

categorical_features = ['location']  
numeric_features = [col for col in X.columns if col not in categorical_features]

column_trans = make_column_transformer(
    (OneHotEncoder(sparse=False), categorical_features),
    (StandardScaler(), numeric_features)
)

lr = LinearRegression()

pipe = make_pipeline(column_trans, lr)

pipe.fit(X_train, y_train)

/Users/caninophile/anaconda3/lib/python3.11/site-packages/sklearn/preprocessing/_encoders.py:868: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location']),
                                                 ('standardscaler',
                                                  StandardScaler(),
                                                  ['total_sqft', 'bath',
                                                   'bhk'])])),
                ('linearregression', LinearRegression())])

In [119]:
predictions = pipe.predict(X_test)


r2 = r2_score(y_test, predictions)
print("R-squared score:", r2)

R-squared score: 0.8296487131920007